// Вывести квадрат числа 

Console.Write("Введите число возводимое в квадрат - ");
int numberA = Int32.Parse(Console.ReadLine());
int result = (numberA * numberA);
Console.Write("Ответ - ");
Console.WriteLine(result);